{
	"users": [
		{
			"id": "001",
			"login": "leonid",
			"password": "qwe123",
			"registered_at": "2024-11-24",
			"role_id": 0
		},
		{
			"login": "elena",
			"password": "qwe123",
			"registered_at": "2045-06-15",
			"role_id": 1,
			"id": "Nuaxyqx"
		},
		{
			"login": "maxim",
			"password": "qwe123",
			"registered_at": "2055-05-22",
			"role_id": 1,
			"id": "g-cwhHO"
		},
		{
			"login": "Poroo",
			"password": "qwe123",
			"registered_at": "2037-06-23",
			"role_id": 1,
			"id": "FitRo9e"
		}
	],
	"roles": [
		{
			"id": 0,
			"name": "Администратор"
		},
		{
			"id": 1,
			"name": "Покупатель"
		},
		{
			"id": 2,
			"name": "Гость"
		}
	],
	"products": [
		{
			"id": "001",
			"categoryName": "armchair",
			"title": "Supreme Play",
			"image_url": "https://tse1.mm.bing.net/th?id=OIG3.I1L5xUy2WT6kymDnwIHy&pid=ImgGn",
			"content": "Представляем вам стильное и эргономичное игровое кресло, созданное для максимального комфорта и производительности.\n Это кресло идеально подходит для долгих игровых сессий и работы за компьютером. Его продуманный дизайн обеспечивает отличную поддержку для вашей спины и шеи, что помогает избежать усталости даже при длительном использовании. Изготовлено из высококачественных материалов, что гарантирует долговечность и надежность. Кроме того, кресло оснащено регулируемыми подлокотниками и механизмом наклона спинки, что позволяет настроить его под ваши индивидуальные предпочтения. Прочная пятилучевая база и колесики обеспечивают легкое перемещение кресла по комнате, а стильный внешний вид делает его идеальным дополнением к вашему игровому или рабочему пространству. Дополнительные мягкие подушки для головы и поясницы обеспечивают максимальный комфорт, делая это кресло незаменимым для каждого геймера и профессионала.",
			"price": 15990,
			"design": "Кресло выполнено в современном стиле с высокой спинкой, обеспечивающей поддержку спины и шеи. Логотип на спинке и подголовнике подчеркивает брендовый характер изделия.",
			"comfort": " Высокая спинка кресла обеспечивает поддержку шеи и поясницы, что предотвращает усталость во время долгих часов использования. Регулируемые подлокотники позволяют настроить кресло под ваши личные предпочтения.",
			"materials": "Кресло изготовлено из высококачественных материалов, которые обеспечивают долговечность и комфорт. Прочная пятилучевая база с колесиками позволяет легко перемещать кресло по комнате.",
			"functionality": "Регулируемая высота и наклон спинки обеспечивают оптимальное положение для работы и игр, позволяя настроить кресло под индивидуальные потребности."
		},
		{
			"id": "002",
			"categoryName": "armchair",
			"title": "Gaming Comfort",
			"image_url": "https://tse1.mm.bing.net/th?id=OIG1.cBni7fEhmPYail0IFjl7&pid=ImgGn",
			"content": "Представляем вам стильное и эргономичное игровое кресло, созданное для максимального комфорта и производительности. \nЭто кресло идеально подходит для долгих игровых сессий и работы за компьютером. Его продуманный дизайн обеспечивает отличную поддержку для вашей спины и шеи, что помогает избежать усталости даже при длительном использовании. \nИзготовлено из высококачественных материалов, что гарантирует долговечность и надежность. Кроме того, кресло оснащено регулируемыми подлокотниками и механизмом наклона спинки, что позволяет настроить его под ваши индивидуальные предпочтения. \nПрочная пятилучевая база и колесики обеспечивают легкое перемещение кресла по комнате, а стильный внешний вид делает его идеальным дополнением к вашему игровому или рабочему пространству. \nДополнительные мягкие подушки для головы и поясницы обеспечивают максимальный комфорт, делая это кресло незаменимым для каждого геймера и профессионала.",
			"price": 12990,
			"design": "Кресло выполнено в светло-серых тонах с черными акцентами, придающими ему современный и стильный вид. Логотип в виде круга и стрелок украшает спинку.",
			"comfort": "Эргономичная спинка кресла обеспечивает поддержку спины и шеи, предотвращая усталость. Регулируемые подлокотники позволяют настроить кресло под ваши личные предпочтения.",
			"materials": "Кресло изготовлено из высококачественных материалов, что обеспечивает долговечность и комфорт.",
			"functionality": "Регулируемая высота и наклон спинки обеспечивают оптимальное положение для работы и игр, позволяя настроить кресло под индивидуальные потребности. Прочная пятилучевая база с колесиками позволяет легко перемещать кресло по комнате."
		},
		{
			"id": "003",
			"title": "Ergo Elite",
			"categoryName": "armchair",
			"image_url": "https://tse2.mm.bing.net/th?id=OIG3.sxI2H48F8Vs0WApiimTS&pid=ImgGn",
			"content": "Представляем вам стильное и эргономичное игровое кресло, созданное для максимального комфорта и производительности. \nЭто кресло идеально подходит для долгих игровых сессий и работы за компьютером. Его продуманный дизайн обеспечивает отличную поддержку для вашей спины и шеи, что помогает избежать усталости даже при длительном использовании. \nИзготовлено из высококачественных материалов, что гарантирует долговечность и надежность. Кроме того, кресло оснащено регулируемыми подлокотниками и механизмом наклона спинки, что позволяет настроить его под ваши индивидуальные предпочтения. \nПрочная пятилучевая база и колесики обеспечивают легкое перемещение кресла по комнате, а стильный внешний вид делает его идеальным дополнением к вашему игровому или рабочему пространству. \nДополнительные мягкие подушки для головы и поясницы обеспечивают максимальный комфорт, делая это кресло незаменимым для каждого геймера и профессионала.",
			"price": 19990,
			"design": "Кресло выполнено в светло-серых тонах с черными акцентами, придающими ему современный и стильный вид. Логотип в виде круга и стрелок украшает спинку.",
			"comfort": "Эргономичная спинка кресла обеспечивает поддержку спины и шеи, предотвращая усталость. Регулируемые подлокотники позволяют настроить кресло под ваши личные предпочтения.",
			"materials": "Кресло изготовлено из высококачественных материалов, что обеспечивает долговечность и комфорт.",
			"functionality": "Регулируемая высота и наклон спинки обеспечивают оптимальное положение для работы и игр, позволяя настроить кресло под индивидуальные потребности. Прочная пятилучевая база с колесиками позволяет легко перемещать кресло по комнате."
		},
		{
			"image_url": "https://tse1.mm.bing.net/th?id=OIG4.OwGwNpidZTWJYIbTYc.q&pid=ImgGn",
			"content": "Prime Comfort - стильное и эргономичное игровое кресло, созданное для максимального комфорта и производительности. Это кресло идеально подходит для долгих игровых сессий и работы за компьютером. Посмотрите, как его продуманный дизайн обеспечивает отличную поддержку для вашей спины и шеи, помогая избежать усталости даже при длительном использовании.",
			"price": 15990,
			"title": "Prime Comfort",
			"categoryName": "armchair",
			"design": "Кресло изготовлено из высококачественных материалов, что обеспечивает его долговечность и комфорт. Прочная и устойчивая база позволяет креслу выдерживать значительные нагрузки.",
			"comfort": "Эргономичная конструкция кресла поддерживает спину и шею, снижая усталость при длительном использовании. Мягкие подушки для головы и спины обеспечивают дополнительный комфорт.",
			"materials": "Кресло оснащено регулируемыми подлокотниками и механизмом наклона спинки, позволяя настроить кресло под индивидуальные предпочтения. Высота кресла также регулируется, чтобы соответствовать различным высотам рабочих столов.",
			"functionality": "Кресло выполнено в современном и стильном дизайне с логотипом на спинке, что придает ему профессиональный и привлекательный вид. Оно станет прекрасным дополнением к вашему игровому или рабочему пространству.",
			"id": "iwM3etz"
		},
		{
			"image_url": "https://tse2.mm.bing.net/th?id=OIG2.WyJYfOWEwd0B5cqGc0P6&pid=ImgGn",
			"content": "ProX Elite Gaming — это идеальное сочетание комфорта, стиля и функциональности. Независимо от того, являетесь ли вы заядлым геймером или профессионалом, работающим из дома, это кресло обеспечит вам поддержку и удобство в течение долгих часов. Его эргономичный дизайн и высококачественные материалы делают его незаменимым дополнением к любому современному рабочему месту или игровой зоне. Боковые подушки и накладки добавляют дополнительную поддержку и стильный внешний вид. Кресло также имеет усиленный механизм фиксации наклона, который предотвращает нежелательное покачивание. Специальные отверстия для вентиляции в обивке спинки обеспечивают комфорт даже в жаркую погоду. Универсальный дизайн кресла подойдет не только для геймеров, но и для офисных работников. ProX Elite Gaming  — это надежность, продуманность и стиль, объединенные в одной модели.",
			"price": 24990,
			"title": "ProX Elite Gaming",
			"categoryName": "armchair",
			"design": "ProX Elite Gaming - отличается стильным и эргономичным дизайном, разработанным для геймеров и профессионалов, которые ценят как эстетичность, так и функциональность. Высокая спинка, угловатые контуры и динамичное сочетание красного и черного цветов придают креслу современный вид, который идеально дополнит любой игровой или рабочий интерьер.",
			"comfort": "Кресло создано с учетом длительных игровых сессий и обеспечивает исключительный комфорт благодаря регулируемым подушкам для поддержки головы и поясницы. Наполнитель из плотной пены высокой плотности обеспечивает оптимальную мягкость, а механизм наклона позволяет настроить положение кресла под индивидуальные предпочтения.",
			"materials": "ProX Elite Gaming - выполнено из материалов премиум-класса: обивка из прочного кожезаменителя приятна на ощупь и легко очищается. Прочная металлическая основа и плавно вращающиеся колесики гарантируют долговечность и легкость перемещения.",
			"functionality": "Кресло оснащено широким набором регулируемых функций, включая настройку высоты, подлокотников и угла наклона, что позволяет пользователю выбрать идеальное положение для сидения. Функция вращения на 360 градусов добавляет удобства, делая кресло подходящим как для работы, так и для отдыха.",
			"id": "7XBbds8"
		},
		{
			"image_url": "https://tse4.mm.bing.net/th?id=OIG4.D4xFxz_X6HX9WZ84K_Gz&pid=ImgGn",
			"content": "Zenith Edge Gaming сочетает в себе стильный дизайн, высококачественные материалы и современные технологии. Это кресло станет незаменимым спутником для геймеров и профессионалов, ценящих комфорт и эстетику. Элегантность, функциональность и долговечность делают его отличным выбором для тех, кто стремится к максимальному удобству и продуктивности. Дополнительно кресло оснащено усиленной рамой, которая выдерживает повышенные нагрузки, обеспечивая долговечность. Специальная вентиляционная вставка в спинке кресла способствует лучшему воздухообмену, что делает использование комфортным даже в жаркую погоду. Эргономичный дизайн снижает нагрузку на спину и шею, предотвращая усталость при длительном использовании. Простая система сборки позволяет быстро установить кресло без лишних усилий.",
			"price": 20990,
			"title": "Zenith Edge Gaming",
			"categoryName": "armchair",
			"design": "Zenith Edge Gaming  выделяется своим стильным минималистичным дизайном с черно-белой цветовой гаммой, которая добавляет элегантности любому пространству. Высокая спинка, плавные линии и акцентные швы создают современный и профессиональный вид. Это кресло станет центральным элементом как игровой зоны, так и рабочего пространства.",
			"comfort": "Созданное для долгих игровых сессий и рабочего времени, кресло обеспечивает непревзойденный комфорт. Подушки с эффектом памяти адаптируются к форме тела, а регулируемая поясничная и шейная поддержка помогают поддерживать правильную осанку. Механизм наклона и возможность зафиксировать оптимальный угол сидения делают его идеальным выбором для отдыха и концентрации.",
			"materials": "Обивка выполнена из высококачественного материала, сочетающего матовую текстуру белого и черного цвета. Эта ткань прочная, приятная на ощупь и проста в уходе. Надежная металлическая основа обеспечивает устойчивость, а бесшумные колесики позволяют легко перемещать кресло, не повреждая пол.",
			"functionality": "Кресло оснащено широким набором функций: регулируемыми по высоте подлокотниками, системой наклона до 135 градусов и возможностью вращения на 360 градусов. Все элементы настроек интуитивно просты, что позволяет адаптировать кресло под любые предпочтения.",
			"id": "40AiIcf"
		},
		{
			"image_url": "https://tse3.mm.bing.net/th?id=OIG2.ELCn2bAbfh.UIkWSTY9w&pid=ImgGn",
			"content": "Spectra Fusion Gaming — это сочетание инновационного дизайна, превосходного комфорта и высококачественных материалов. Это кресло станет идеальным выбором для тех, кто хочет выделиться и при этом не жертвовать удобством. Универсальность и надежность делают его идеальным для геймеров, стримеров, а также для профессионалов, работающих в интенсивном режиме. Независимо от задач, Spectra Fusion Gaming обеспечит поддержку, стиль и комфорт. Дополнительные возможности включают вентиляционные отверстия в спинке кресла, которые обеспечивают циркуляцию воздуха и предотвращают перегрев в жаркую погоду. \nПодушки для поясницы и шеи легко снимаются для настройки под личные предпочтения. Усиленная конструкция позволяет креслу выдерживать нагрузку до 150 кг, оставаясь устойчивым и надежным. Лаконичная форма подлокотников обеспечивает комфорт для рук при длительном использовании.",
			"price": 21990,
			"title": "Spectra Fusion",
			"categoryName": "armchair",
			"design": "Spectra Fusion Gaming привлекает внимание своим уникальным дизайном с яркой градиентной расцветкой, переходящей от глубокого синего к яркому оранжевому. Черные акценты и стильные швы подчеркивают современный и смелый облик кресла.",
			"comfort": "Кресло разработано с учетом потребностей геймеров и профессионалов, проводящих долгие часы за работой или играми. Высокая спинка, мягкая обивка и эргономичная форма обеспечивают максимальную поддержку спины и шеи. Регулируемые подушки для поясничной и шейной поддержки делают кресло еще удобнее.",
			"materials": "Spectra Fusion Gaming выполнено из премиум-материалов, включая кожезаменитель высокого качества с матовой текстурой. Градиентный узор устойчив к выцветанию и легко очищается от загрязнений. Прочная металлическая рама и надежная крестовина обеспечивают долговечность, а мягкие колесики подходят для любых типов полов.",
			"functionality": "Кресло оснащено широким спектром регулировок, включая настройку высоты, наклона спинки до 135 градусов и вращение на 360 градусов. Подлокотники можно настроить по высоте и углу наклона для оптимального удобства. Все механизмы легко и интуитивно управляются, позволяя адаптировать кресло под любые предпочтения.",
			"id": "i47Q4_X"
		},
		{
			"image_url": "https://tse1.mm.bing.net/th?id=OIG1.2KjjvwLQncrsqIxTW4sS&pid=ImgGn",
			"content": "CosmoNova Gaming сочетает в себе стильный креативный дизайн, премиальные материалы и современные технологии. Это кресло идеально подойдет для геймеров, любителей яркого интерьера и всех, кто хочет почувствовать себя в центре звездной галактики. Его эргономичность и высококачественная сборка делают его незаменимым помощником для продуктивной работы и комфортного отдыха.\nДополнительные преимущества включают усиленную базу, обеспечивающую устойчивость даже при максимальной нагрузке, а также систему вентиляции для предотвращения перегрева. Эффектная галактическая расцветка вдохновляет и создаёт настроение, превращая каждую игровую сессию в космическое приключение. CosmoNova Gaming — это не просто кресло, это уникальный опыт и стиль, который подчеркивает вашу индивидуальность.",
			"price": 27990,
			"title": "CosmoNova Gaming",
			"categoryName": "armchair",
			"design": "CosmoNova Gaming поражает своим уникальным дизайном в стиле галактики. Расцветка кресла напоминает звездное небо с переливами фиолетового, синего и черного, а детализированные узоры с изображением созвездий и туманностей создают эффект глубины космоса. Этот креативный дизайн добавит изюминку вашему игровому пространству и станет центром внимания в любой комнате.",
			"comfort": "Кресло создано с учетом максимального удобства для длительных игровых сессий и работы. Высокая спинка с эргономичной формой поддерживает позвоночник, а мягкие подушки с эффектом памяти адаптируются под форму вашего тела. Дополнительные подушки для шеи и поясницы обеспечивают правильную осанку и комфорт даже при многочасовом использовании.",
			"materials": "Обивка выполнена из премиального кожезаменителя с матовой текстурой, который приятен на ощупь и легко очищается. Прочная металлическая рама гарантирует долговечность, а износостойкие детали сохранят привлекательный вид кресла даже при интенсивном использовании. Колеса выполнены из мягкого материала, защищающего пол от царапин.",
			"functionality": "CosmoNova Gaming оснащено широким спектром функций: регулировка высоты сидения, наклон спинки до 135 градусов, вращение на 360 градусов и настройка подлокотников по высоте и углу наклона. Все механизмы просты и надежны, позволяя легко настроить кресло под свои нужды.",
			"id": "nhDCDoX"
		},
		{
			"image_url": "https://tse1.mm.bing.net/th?id=OIG3.lnumdztItR2LcS5wzLqN&pid=ImgGn",
			"content": "ShadowStrike RGB сочетает стиль, комфорт и высокую производительность. Это устройство идеально подходит для киберспортсменов, геймеров и всех, кто ищет надежную мышь для повседневной работы. Поддержка программного обеспечения позволяет настраивать функциональность мыши и подсветку, чтобы она максимально соответствовала вашим требованиям.\nЭта мышь предлагает широкий спектр возможностей: возможность переключения между несколькими уровнями DPI в реальном времени, встроенная память для сохранения настроек и ультралегкий вес для динамичной игры. ShadowStrike RGB Gaming Mouse — это идеальный инструмент для достижения успеха в любой задаче, будь то игра или работа.",
			"price": 5990,
			"title": "ShadowStrike RGB",
			"categoryName": "Mouse",
			"design": "ShadowStrike RGB отличается футуристическим дизайном с матовой черной поверхностью и элегантной подсветкой RGB, проходящей вдоль корпуса. Эргономичная форма идеально ложится в руку, обеспечивая удобство даже при длительных игровых сессиях. Лаконичный и современный вид делает эту мышь не только функциональным устройством, но и стильным дополнением вашего рабочего или игрового пространства.",
			"comfort": "Мышь разработана с учетом потребностей геймеров и профессионалов, ценящих комфорт и контроль. Ее продуманная форма снижает нагрузку на кисть, а текстурированные боковые поверхности обеспечивают надежное сцепление. Оптимальное расположение кнопок позволяет мгновенно реагировать на игровые события.",
			"materials": "Корпус мыши выполнен из высококачественного пластика с матовым покрытием, устойчивым к отпечаткам пальцев. Подсветка RGB обеспечивает множество цветовых настроек, а прочный плетеный кабель добавляет долговечности и предотвращает запутывание. Компоненты мыши протестированы на долгосрочную эксплуатацию, гарантируя стабильную работу на протяжении миллионов кликов.",
			"functionality": "ShadowStrike RGB оснащена высокоточным сенсором с разрешением до 16,000 DPI, который можно настроить под любые задачи — от быстрого передвижения в играх до точной работы в графических редакторах. Мышь имеет 7 программируемых кнопок, которые легко настроить под ваши предпочтения. RGB-подсветка поддерживает множество режимов, включая статичное свечение, динамические эффекты и пользовательские настройки.",
			"id": "6MKpjX8"
		},
		{
			"image_url": "https://tse1.mm.bing.net/th?id=OIG4.OX5qm6uR4zb5hyWFLCLp&pid=ImgGn",
			"content": "GlideX Pro RGB — это идеальное сочетание стиля, комфорта и высокой производительности. Благодаря современным технологиям и эргономичному дизайну эта мышь подойдет как для геймеров, так и для профессионалов, которые ценят точность и надежность.\nДополнительные возможности включают мгновенное переключение DPI, встроенную память для сохранения профилей, плавный и отзывчивый ход кнопок, а также оптимизированный вес для быстрой и точной игры. GlideX Pro RGB станет вашим надежным спутником как в виртуальных битвах, так и в повседневной работе.",
			"price": 7990,
			"title": "GlideX Pro RGB",
			"categoryName": "Mouse",
			"design": "Мышка изготовлена из качественных материалов, обеспечивающих её долговечность и надежность. Противоскользящее покрытие предотвращает случайные соскальзывания во время игры.",
			"comfort": "Мышь разработана для обеспечения максимального удобства во время долгих игровых сессий. Ее форма адаптирована к естественному положению руки, снижая усталость и напряжение. Текстурированные поверхности на боках предотвращают скольжение, обеспечивая надежный контроль даже при интенсивных движениях.",
			"materials": "Корпус выполнен из прочного пластика премиум-класса с глянцевым покрытием, которое устойчиво к загрязнениям и легко очищается. RGB-подсветка равномерно распределяется по корпусу, создавая эффектный внешний вид. Прочный плетеный кабель выдерживает интенсивное использование и не путается. Надежные переключатели обеспечивают долговечность, выдерживая до 20 миллионов нажатий.",
			"functionality": "GlideX Pro RGB оснащена высокоточным оптическим сенсором с разрешением до 18,000 DPI, который можно настраивать под любые задачи. Мышь имеет 7 программируемых кнопок, позволяющих задавать макросы и команды для повышения эффективности в играх. RGB-подсветка поддерживает несколько режимов, включая переливы, дыхание и статичное свечение, с возможностью полной настройки через программное обеспечение.",
			"id": "gfE6yh5"
		},
		{
			"image_url": "https://tse1.mm.bing.net/th?id=OIG4.XTwJqc6EAakCe4Lf0rcm&pid=ImgGn",
			"content": "CrimsonEdge Pro RGB — это идеальное сочетание стиля, удобства и функциональности. Она подойдёт как профессиональным геймерам, так и любителям, которые хотят получить максимальную отдачу от каждого движения.\nДополнительные преимущества включают:\n    -Переключение DPI на лету для моментального переключения между скоростью и точностью.\n-Встроенная память для сохранения профилей, позволяющая использовать индивидуальные настройки на любом устройстве.\n-Продвинутая система охлаждения, предотвращающая перегрев даже в самых напряжённых играх.\n-Улучшенные переключатели кнопок с моментальным откликом.\n-Оптимизированная конструкция для уменьшения веса без потери прочности. \n-Совместимость с большинством игровых платформ, включая ПК, ноутбуки и игровые консоли.\n-Усовершенствованное программное обеспечение для настройки макросов, кнопок и RGB-подсветки.\n-Стойкое покрытие корпуса, сохраняющее эстетический вид даже после долгого использования.\n-Широкая база с низким коэффициентом трения для плавных движений.\n-Стильный и современный дизайн, который подчеркнёт вашу индивидуальность и дополнит любую игровую установку.\n",
			"price": 7990,
			"title": "CrimsonEdge Pro",
			"categoryName": "Mouse",
			"design": "CrimsonEdge Pro RGB выполнена в агрессивном и современном стиле. Матовая черная поверхность с металлическими красными акцентами подчеркивает её динамичный характер. RGB-подсветка, расположенная вдоль боковых граней и вокруг колеса прокрутки, добавляет индивидуальности и позволяет настроить мышь под ваш вкус. Эстетика устройства делает его центром внимания в любом игровом сетапе.",
			"comfort": "Мышь создана для долгих игровых сессий. Эргономичная форма идеально ложится в руку, снижая напряжение и усталость. Текстурированные боковые панели обеспечивают надежное сцепление, даже при быстрых и интенсивных движениях. Лёгкий вес мыши способствует легкости управления, что делает её идеальной для динамичных игр.",
			"materials": "Корпус изготовлен из качественного матового пластика, устойчивого к загрязнениям и царапинам. Металлические элементы придают мыши премиальный вид, а плетеный кабель обеспечивает долговечность и защиту от износа. Внутренние компоненты созданы для многолетнего использования, выдерживая миллионы нажатий.",
			"functionality": "CrimsonEdge Pro RGB оснащена высокоточным оптическим сенсором с разрешением до 20,000 DPI, что позволяет настраивать мышь под любой стиль игры. Восемь программируемых кнопок дают возможность задать макросы и быстрые команды, повышая вашу игровую эффективность. RGB-подсветка с несколькими зонами поддерживает широкие возможности настройки, включая выбор цветов и режимов свечения через специальное программное обеспечение.",
			"id": "-2mXIzl"
		},
		{
			"image_url": "https://tse4.mm.bing.net/th?id=OIG3.FksScUKljCc5xsYiVKFv&pid=ImgGn",
			"content": "LumiStrike Pro — это сочетание производительности, комфорта и стиля. Она идеально подходит для геймеров, которым важны скорость и точность, а также для профессионалов, которым требуется надёжность в работе.\nДополнительные преимущества:\n-Полная поддержка программного обеспечения для настройки макросов и режимов подсветки.\n-Совместимость с Windows, macOS и игровыми консолями.\n-Анти-прокликание (N-Key Rollover) и полное отсутствие фантомных нажатий.\n-Прочный кабель с оплеткой и разъем USB-C для удобного подключения.\n-Усиленные ножки для стабильного положения на рабочей поверхности.\nLumiStrike Pro станет вашим идеальным выбором для достижения успеха в играх и продуктивной работы.",
			"price": 9900,
			"title": "LumiStrike Pro",
			"categoryName": "Keyboard",
			"design": "LumiStrike Pro сочетает стильный и современный дизайн с функциональностью. Черная матовая поверхность и яркая настраиваемая RGB-подсветка создают эффектное визуальное оформление. Компактный, но полноразмерный корпус включает цифровой блок и мультимедийные кнопки для удобного управления. Угловатые линии и минималистичный стиль подчеркивают игровую направленность клавиатуры.",
			"comfort": "Клавиатура оснащена съемной подставкой для запястий, которая обеспечивает комфорт даже при длительном использовании. Эргономичная конструкция и оптимальная высота клавиш снижают нагрузку на руки. Продуманное расположение кнопок делает её удобной как для работы, так и для игр.",
			"materials": "Корпус клавиатуры выполнен из прочного алюминиевого сплава, что обеспечивает долговечность и устойчивость к износу. Клавиши изготовлены из износостойкого пластика с гравировкой, которая не стирается со временем. Встроенные механические переключатели отличаются высокой надёжностью и рассчитаны на миллионы нажатий.",
			"functionality": "LumiStrike Pro оснащена механическими переключателями, которые обеспечивают чёткий тактильный отклик и мгновенную реакцию. Настраиваемая RGB-подсветка поддерживает различные режимы, включая статичное свечение, пульсацию, волны и индивидуальные настройки для каждого пользователя. Доступ к мультимедийным функциям упрощён благодаря выделенным клавишам.",
			"id": "SoBAmA4"
		},
		{
			"image_url": "https://tse4.mm.bing.net/th?id=OIG1.hF10iHp45V3HASdOSp5V&pid=ImgGn",
			"content": "InfernoStrike Red  — это не просто клавиатура, а инструмент для достижения побед. Её надёжность, стиль и эргономичность делают её идеальной для любого пользователя — от профессионального геймера до офисного работника.\nДополнительные преимущества:\n-Полностью настраиваемая красная LED-подсветка для создания идеальной атмосферы.\n-Программируемые кнопки и макросы для упрощения игрового процесса.\n-Совместимость с большинством операционных систем, включая Windows и macOS.\n-Удобные мультимедийные кнопки для быстрого управления звуком и видео.\n-Прочный кабель с оплёткой для долгого срока службы и защиты от повреждений.",
			"price": 12990,
			"title": "InfernoStrike Red",
			"categoryName": "Keyboard",
			"design": "InfernoStrike Red обладает стильным и мощным внешним видом. Чёрный матовый корпус идеально сочетается с яркой красной подсветкой, создающей атмосферу интенсивной игры. Минималистичные линии и компактный, но полноразмерный дизайн с цифровым блоком делают клавиатуру элегантной и универсальной. Красная подсветка усиливает ощущение динамики и готовности к бою.",
			"comfort": "Эта клавиатура разработана с учетом потребностей геймеров. Съемная подставка для запястий обеспечивает комфорт при длительных сессиях, снижая нагрузку на руки. Оптимальная высота и расположение клавиш способствуют быстрому доступу и удобству использования. Эргономичная конструкция идеально подходит как для игр, так и для работы.",
			"materials": "Корпус выполнен из прочного алюминиевого сплава, что придаёт клавиатуре долговечность и устойчивость к износу. Клавиши изготовлены из высококачественного пластика с гравировкой, которая устойчива к стиранию. Механические переключатели обеспечивают тактильный отклик и надёжную работу даже при интенсивном использовании.",
			"functionality": "InfernoStrike Red  оснащена высокоточными механическими переключателями для мгновенной реакции и чёткого отклика. Подсветка клавиш поддерживает несколько режимов, включая статичный, пульсирующий и волнообразный, которые можно настроить под свои предпочтения. Поддержка анти-прокликивания (N-Key Rollover) гарантирует точность в самых напряжённых игровых моментах.",
			"id": "iyw24vd"
		},
		{
			"image_url": "https://tse4.mm.bing.net/th?id=OIG1.U.vaQPqtq_Bst2ayLmJu&pid=ImgGn",
			"content": "SpectrumPro — высококачественная игровая клавиатура с прочным матовым корпусом и ABS-клавишами. Светодиодная подсветка с выбором цветовых режимов. Программируемые клавиши и анти-гостинг для точных игровых команд. Мультимедийные клавиши для удобного управления. Эргономичная подставка для запястий снижает усталость. Противоскользящие ножки обеспечивают устойчивость. Встроенная память сохраняет настройки. Подходит как для геймеров, так и для повседневного использования.",
			"price": 10990,
			"title": "PrismWave",
			"design": " это клавиатура, которая впечатляет с первого взгляда. Ее дизайн выполнен в яркой палитре, где каждый ряд клавиш светится разным цветом. Верхний ряд сверкает глубоким синим, переходя в более теплые тона, такие как зеленый и желтый в середине, и заканчивается насыщенным красным и пурпурным внизу.",
			"comfort": "Клавиши имеют сбалансированный ход, обеспечивающий плавное нажатие без чрезмерного усилия, что снижает нагрузку на пальцы и кисти. Противоскользящие ножки на основании клавиатуры гарантируют её устойчивость на любой поверхности, предотвращая случайное скольжение во время интенсивных игровых сессий.",
			"materials": "SpectrumPro создана с использованием высококачественных материалов, обеспечивающих долговечность и надежность. Корпус клавиатуры выполнен из прочного матового пластика, который не только выглядит элегантно, но и устойчив к износу и царапинам",
			"functionality": "Настраивайте и программируйте макросы для игровых команд или часто используемых функций, что позволяет мгновенно выполнять сложные действия.",
			"categoryName": "Keyboard",
			"id": "Ot1foZ2"
		}
	],
	"categories": [
		{
			"id": "1",
			"label": "armchair",
			"name": "Кресла"
		},
		{
			"id": "2",
			"label": "Mouse",
			"name": "Мышки"
		},
		{
			"id": "3",
			"label": "Keyboard",
			"name": "Клавиатуры"
		}
	],
	"sessions": [
		{
			"hash": "0.46288098725671988908914045168785378336906433105469",
			"user": {
				"id": "001",
				"login": "leonid",
				"password": "qwe123",
				"registeredAt": "2024-11-24",
				"roleId": 0
			},
			"id": 1
		},
		{
			"hash": "0.83693367967915821559188316314248368144035339355469",
			"user": {
				"id": "001",
				"login": "leonid",
				"password": "qwe123",
				"registeredAt": "2024-11-24",
				"roleId": 0
			},
			"id": 2
		},
		{
			"hash": "0.93012822398346184371575873228721320629119873046875",
			"user": {
				"id": "001",
				"login": "leonid",
				"password": "qwe123",
				"registeredAt": "2024-11-24",
				"roleId": 0
			},
			"id": 3
		}
	]
}
